###################################################################

# Created by write_sdc on Thu Feb 12 21:29:36 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_mode segmented
set_wire_load_model -name TSMC16K_Lowk_Conservative -library tcbn65lpbc
set_max_fanout 8 [current_design]
set_wire_load_selection_group WireAreaLowkCon
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[31]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[30]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[29]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[28]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[27]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[26]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[25]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[24]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[23]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[22]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[21]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[20]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[19]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[18]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[17]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[16]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[15]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[14]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[13]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[12]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[11]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[10]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[9]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[8]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[7]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[6]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[5]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[4]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[3]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[2]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[1]}]
set_load -pin_load 0.01 [get_ports {static_rdata_group_mux[0]}]
set_load -pin_load 0.01 [get_ports static_ready_group_mux]
set_load -pin_load 0.01 [get_ports sram_ren]
set_load -pin_load 0.01 [get_ports sram_wen]
set_load -pin_load 0.01 [get_ports {sram_addr[10]}]
set_load -pin_load 0.01 [get_ports {sram_addr[9]}]
set_load -pin_load 0.01 [get_ports {sram_addr[8]}]
set_load -pin_load 0.01 [get_ports {sram_addr[7]}]
set_load -pin_load 0.01 [get_ports {sram_addr[6]}]
set_load -pin_load 0.01 [get_ports {sram_addr[5]}]
set_load -pin_load 0.01 [get_ports {sram_addr[4]}]
set_load -pin_load 0.01 [get_ports {sram_addr[3]}]
set_load -pin_load 0.01 [get_ports {sram_addr[2]}]
set_load -pin_load 0.01 [get_ports {sram_addr[1]}]
set_load -pin_load 0.01 [get_ports {sram_addr[0]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[31]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[30]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[29]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[28]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[27]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[26]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[25]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[24]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[23]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[22]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[21]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[20]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[19]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[18]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[17]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[16]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[15]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[14]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[13]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[12]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[11]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[10]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[9]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[8]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[7]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[6]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[5]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[4]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[3]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[2]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[1]}]
set_load -pin_load 0.01 [get_ports {sram_wdata[0]}]
set_load -pin_load 0.01 [get_ports reg_wen]
set_load -pin_load 0.01 [get_ports reg_ren]
set_load -pin_load 0.01 [get_ports {cr_wdata[16]}]
set_load -pin_load 0.01 [get_ports {cr_wdata[15]}]
set_load -pin_load 0.01 [get_ports {cr_wdata[14]}]
set_load -pin_load 0.01 [get_ports {cr_wdata[13]}]
set_load -pin_load 0.01 [get_ports {cr_wdata[12]}]
set_load -pin_load 0.01 [get_ports {cr_wdata[11]}]
set_load -pin_load 0.01 [get_ports {cr_wdata[10]}]
set_load -pin_load 0.01 [get_ports {cr_wdata[9]}]
set_load -pin_load 0.01 [get_ports {cr_wdata[8]}]
set_load -pin_load 0.01 [get_ports {cr_wdata[7]}]
set_load -pin_load 0.01 [get_ports {cr_wdata[6]}]
set_load -pin_load 0.01 [get_ports {cr_wdata[5]}]
set_load -pin_load 0.01 [get_ports {cr_wdata[4]}]
set_load -pin_load 0.01 [get_ports {cr_wdata[3]}]
set_load -pin_load 0.01 [get_ports {cr_wdata[2]}]
set_load -pin_load 0.01 [get_ports {cr_wdata[1]}]
set_load -pin_load 0.01 [get_ports {cr_wdata[0]}]
set_ideal_network [get_ports rst_n]
create_clock [get_ports clk]  -period 2  -waveform {0 1}
set_clock_uncertainty 0.2  [get_clocks clk]
set_clock_transition -max -rise 0.2 [get_clocks clk]
set_clock_transition -max -fall 0.2 [get_clocks clk]
set_clock_transition -min -rise 0.2 [get_clocks clk]
set_clock_transition -min -fall 0.2 [get_clocks clk]
set_false_path   -through [list [get_ports rst_n]]
set_false_path   -through [list [get_ports static_wen_group_mux]]
set_false_path   -through [list [get_ports static_ren_group_mux]]
set_false_path   -through [list [get_ports {static_addr_group_mux[19]}] [get_ports             \
{static_addr_group_mux[18]}] [get_ports {static_addr_group_mux[17]}]           \
[get_ports {static_addr_group_mux[16]}] [get_ports                             \
{static_addr_group_mux[15]}] [get_ports {static_addr_group_mux[14]}]           \
[get_ports {static_addr_group_mux[13]}] [get_ports                             \
{static_addr_group_mux[12]}] [get_ports {static_addr_group_mux[11]}]           \
[get_ports {static_addr_group_mux[10]}] [get_ports {static_addr_group_mux[9]}] \
[get_ports {static_addr_group_mux[8]}] [get_ports {static_addr_group_mux[7]}]  \
[get_ports {static_addr_group_mux[6]}] [get_ports {static_addr_group_mux[5]}]  \
[get_ports {static_addr_group_mux[4]}] [get_ports {static_addr_group_mux[3]}]  \
[get_ports {static_addr_group_mux[2]}] [get_ports {static_addr_group_mux[1]}]  \
[get_ports {static_addr_group_mux[0]}]]
set_false_path   -through [list [get_ports {static_wdata_group_mux[31]}] [get_ports            \
{static_wdata_group_mux[30]}] [get_ports {static_wdata_group_mux[29]}]         \
[get_ports {static_wdata_group_mux[28]}] [get_ports                            \
{static_wdata_group_mux[27]}] [get_ports {static_wdata_group_mux[26]}]         \
[get_ports {static_wdata_group_mux[25]}] [get_ports                            \
{static_wdata_group_mux[24]}] [get_ports {static_wdata_group_mux[23]}]         \
[get_ports {static_wdata_group_mux[22]}] [get_ports                            \
{static_wdata_group_mux[21]}] [get_ports {static_wdata_group_mux[20]}]         \
[get_ports {static_wdata_group_mux[19]}] [get_ports                            \
{static_wdata_group_mux[18]}] [get_ports {static_wdata_group_mux[17]}]         \
[get_ports {static_wdata_group_mux[16]}] [get_ports                            \
{static_wdata_group_mux[15]}] [get_ports {static_wdata_group_mux[14]}]         \
[get_ports {static_wdata_group_mux[13]}] [get_ports                            \
{static_wdata_group_mux[12]}] [get_ports {static_wdata_group_mux[11]}]         \
[get_ports {static_wdata_group_mux[10]}] [get_ports                            \
{static_wdata_group_mux[9]}] [get_ports {static_wdata_group_mux[8]}]           \
[get_ports {static_wdata_group_mux[7]}] [get_ports                             \
{static_wdata_group_mux[6]}] [get_ports {static_wdata_group_mux[5]}]           \
[get_ports {static_wdata_group_mux[4]}] [get_ports                             \
{static_wdata_group_mux[3]}] [get_ports {static_wdata_group_mux[2]}]           \
[get_ports {static_wdata_group_mux[1]}] [get_ports                             \
{static_wdata_group_mux[0]}]]
set_false_path   -through [list [get_ports {static_rdata_group_mux[31]}] [get_ports            \
{static_rdata_group_mux[30]}] [get_ports {static_rdata_group_mux[29]}]         \
[get_ports {static_rdata_group_mux[28]}] [get_ports                            \
{static_rdata_group_mux[27]}] [get_ports {static_rdata_group_mux[26]}]         \
[get_ports {static_rdata_group_mux[25]}] [get_ports                            \
{static_rdata_group_mux[24]}] [get_ports {static_rdata_group_mux[23]}]         \
[get_ports {static_rdata_group_mux[22]}] [get_ports                            \
{static_rdata_group_mux[21]}] [get_ports {static_rdata_group_mux[20]}]         \
[get_ports {static_rdata_group_mux[19]}] [get_ports                            \
{static_rdata_group_mux[18]}] [get_ports {static_rdata_group_mux[17]}]         \
[get_ports {static_rdata_group_mux[16]}] [get_ports                            \
{static_rdata_group_mux[15]}] [get_ports {static_rdata_group_mux[14]}]         \
[get_ports {static_rdata_group_mux[13]}] [get_ports                            \
{static_rdata_group_mux[12]}] [get_ports {static_rdata_group_mux[11]}]         \
[get_ports {static_rdata_group_mux[10]}] [get_ports                            \
{static_rdata_group_mux[9]}] [get_ports {static_rdata_group_mux[8]}]           \
[get_ports {static_rdata_group_mux[7]}] [get_ports                             \
{static_rdata_group_mux[6]}] [get_ports {static_rdata_group_mux[5]}]           \
[get_ports {static_rdata_group_mux[4]}] [get_ports                             \
{static_rdata_group_mux[3]}] [get_ports {static_rdata_group_mux[2]}]           \
[get_ports {static_rdata_group_mux[1]}] [get_ports                             \
{static_rdata_group_mux[0]}]]
set_false_path   -through [list [get_ports static_ready_group_mux]]
set_false_path   -through [list [get_ports scan_id_group_mux]]
set_input_delay -clock clk  0.15  [get_ports rst_n]
set_input_delay -clock clk  0.15  [get_ports static_wen_group_mux]
set_input_delay -clock clk  0.15  [get_ports static_ren_group_mux]
set_input_delay -clock clk  0.15  [get_ports {static_addr_group_mux[19]}]
set_input_delay -clock clk  0.15  [get_ports {static_addr_group_mux[18]}]
set_input_delay -clock clk  0.15  [get_ports {static_addr_group_mux[17]}]
set_input_delay -clock clk  0.15  [get_ports {static_addr_group_mux[16]}]
set_input_delay -clock clk  0.15  [get_ports {static_addr_group_mux[15]}]
set_input_delay -clock clk  0.15  [get_ports {static_addr_group_mux[14]}]
set_input_delay -clock clk  0.15  [get_ports {static_addr_group_mux[13]}]
set_input_delay -clock clk  0.15  [get_ports {static_addr_group_mux[12]}]
set_input_delay -clock clk  0.15  [get_ports {static_addr_group_mux[11]}]
set_input_delay -clock clk  0.15  [get_ports {static_addr_group_mux[10]}]
set_input_delay -clock clk  0.15  [get_ports {static_addr_group_mux[9]}]
set_input_delay -clock clk  0.15  [get_ports {static_addr_group_mux[8]}]
set_input_delay -clock clk  0.15  [get_ports {static_addr_group_mux[7]}]
set_input_delay -clock clk  0.15  [get_ports {static_addr_group_mux[6]}]
set_input_delay -clock clk  0.15  [get_ports {static_addr_group_mux[5]}]
set_input_delay -clock clk  0.15  [get_ports {static_addr_group_mux[4]}]
set_input_delay -clock clk  0.15  [get_ports {static_addr_group_mux[3]}]
set_input_delay -clock clk  0.15  [get_ports {static_addr_group_mux[2]}]
set_input_delay -clock clk  0.15  [get_ports {static_addr_group_mux[1]}]
set_input_delay -clock clk  0.15  [get_ports {static_addr_group_mux[0]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[31]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[30]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[29]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[28]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[27]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[26]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[25]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[24]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[23]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[22]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[21]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[20]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[19]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[18]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[17]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[16]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[15]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[14]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[13]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[12]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[11]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[10]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[9]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[8]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[7]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[6]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[5]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[4]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[3]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[2]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[1]}]
set_input_delay -clock clk  0.15  [get_ports {static_wdata_group_mux[0]}]
set_input_delay -clock clk  0.15  [get_ports scan_id_group_mux]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[31]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[30]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[29]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[28]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[27]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[26]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[25]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[24]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[23]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[22]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[21]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[20]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[19]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[18]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[17]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[16]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[15]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[14]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[13]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[12]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[11]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[10]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[9]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[8]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[7]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[6]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[5]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[4]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[3]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[2]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[1]}]
set_input_delay -clock clk  0.15  [get_ports {sram_rdata[0]}]
set_input_delay -clock clk  0.15  [get_ports sram_ready]
set_input_delay -clock clk  0.15  [get_ports {cr_rdata[16]}]
set_input_delay -clock clk  0.15  [get_ports {cr_rdata[15]}]
set_input_delay -clock clk  0.15  [get_ports {cr_rdata[14]}]
set_input_delay -clock clk  0.15  [get_ports {cr_rdata[13]}]
set_input_delay -clock clk  0.15  [get_ports {cr_rdata[12]}]
set_input_delay -clock clk  0.15  [get_ports {cr_rdata[11]}]
set_input_delay -clock clk  0.15  [get_ports {cr_rdata[10]}]
set_input_delay -clock clk  0.15  [get_ports {cr_rdata[9]}]
set_input_delay -clock clk  0.15  [get_ports {cr_rdata[8]}]
set_input_delay -clock clk  0.15  [get_ports {cr_rdata[7]}]
set_input_delay -clock clk  0.15  [get_ports {cr_rdata[6]}]
set_input_delay -clock clk  0.15  [get_ports {cr_rdata[5]}]
set_input_delay -clock clk  0.15  [get_ports {cr_rdata[4]}]
set_input_delay -clock clk  0.15  [get_ports {cr_rdata[3]}]
set_input_delay -clock clk  0.15  [get_ports {cr_rdata[2]}]
set_input_delay -clock clk  0.15  [get_ports {cr_rdata[1]}]
set_input_delay -clock clk  0.15  [get_ports {cr_rdata[0]}]
set_input_delay -clock clk  0.15  [get_ports {sr_rdata[14]}]
set_input_delay -clock clk  0.15  [get_ports {sr_rdata[13]}]
set_input_delay -clock clk  0.15  [get_ports {sr_rdata[12]}]
set_input_delay -clock clk  0.15  [get_ports {sr_rdata[11]}]
set_input_delay -clock clk  0.15  [get_ports {sr_rdata[10]}]
set_input_delay -clock clk  0.15  [get_ports {sr_rdata[9]}]
set_input_delay -clock clk  0.15  [get_ports {sr_rdata[8]}]
set_input_delay -clock clk  0.15  [get_ports {sr_rdata[7]}]
set_input_delay -clock clk  0.15  [get_ports {sr_rdata[6]}]
set_input_delay -clock clk  0.15  [get_ports {sr_rdata[5]}]
set_input_delay -clock clk  0.15  [get_ports {sr_rdata[4]}]
set_input_delay -clock clk  0.15  [get_ports {sr_rdata[3]}]
set_input_delay -clock clk  0.15  [get_ports {sr_rdata[2]}]
set_input_delay -clock clk  0.15  [get_ports {sr_rdata[1]}]
set_input_delay -clock clk  0.15  [get_ports {sr_rdata[0]}]
set_input_delay -clock clk  0.15  [get_ports reg_ready]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[31]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[30]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[29]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[28]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[27]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[26]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[25]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[24]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[23]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[22]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[21]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[20]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[19]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[18]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[17]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[16]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[15]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[14]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[13]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[12]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[11]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[10]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[9]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[8]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[7]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[6]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[5]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[4]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[3]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[2]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[1]}]
set_output_delay -clock clk  0.1  [get_ports {static_rdata_group_mux[0]}]
set_output_delay -clock clk  0.1  [get_ports static_ready_group_mux]
set_output_delay -clock clk  0.1  [get_ports sram_ren]
set_output_delay -clock clk  0.1  [get_ports sram_wen]
set_output_delay -clock clk  0.1  [get_ports {sram_addr[10]}]
set_output_delay -clock clk  0.1  [get_ports {sram_addr[9]}]
set_output_delay -clock clk  0.1  [get_ports {sram_addr[8]}]
set_output_delay -clock clk  0.1  [get_ports {sram_addr[7]}]
set_output_delay -clock clk  0.1  [get_ports {sram_addr[6]}]
set_output_delay -clock clk  0.1  [get_ports {sram_addr[5]}]
set_output_delay -clock clk  0.1  [get_ports {sram_addr[4]}]
set_output_delay -clock clk  0.1  [get_ports {sram_addr[3]}]
set_output_delay -clock clk  0.1  [get_ports {sram_addr[2]}]
set_output_delay -clock clk  0.1  [get_ports {sram_addr[1]}]
set_output_delay -clock clk  0.1  [get_ports {sram_addr[0]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[31]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[30]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[29]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[28]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[27]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[26]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[25]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[24]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[23]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[22]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[21]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[20]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[19]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[18]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[17]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[16]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[15]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[14]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[13]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[12]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[11]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[10]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[9]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[8]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[7]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[6]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[5]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[4]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[3]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[2]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[1]}]
set_output_delay -clock clk  0.1  [get_ports {sram_wdata[0]}]
set_output_delay -clock clk  0.1  [get_ports reg_wen]
set_output_delay -clock clk  0.1  [get_ports reg_ren]
set_output_delay -clock clk  0.1  [get_ports {cr_wdata[16]}]
set_output_delay -clock clk  0.1  [get_ports {cr_wdata[15]}]
set_output_delay -clock clk  0.1  [get_ports {cr_wdata[14]}]
set_output_delay -clock clk  0.1  [get_ports {cr_wdata[13]}]
set_output_delay -clock clk  0.1  [get_ports {cr_wdata[12]}]
set_output_delay -clock clk  0.1  [get_ports {cr_wdata[11]}]
set_output_delay -clock clk  0.1  [get_ports {cr_wdata[10]}]
set_output_delay -clock clk  0.1  [get_ports {cr_wdata[9]}]
set_output_delay -clock clk  0.1  [get_ports {cr_wdata[8]}]
set_output_delay -clock clk  0.1  [get_ports {cr_wdata[7]}]
set_output_delay -clock clk  0.1  [get_ports {cr_wdata[6]}]
set_output_delay -clock clk  0.1  [get_ports {cr_wdata[5]}]
set_output_delay -clock clk  0.1  [get_ports {cr_wdata[4]}]
set_output_delay -clock clk  0.1  [get_ports {cr_wdata[3]}]
set_output_delay -clock clk  0.1  [get_ports {cr_wdata[2]}]
set_output_delay -clock clk  0.1  [get_ports {cr_wdata[1]}]
set_output_delay -clock clk  0.1  [get_ports {cr_wdata[0]}]
